UNIVENTO/app/views/event/index.html.erb

        <td>
          <% event.tags.each do |link| %>
---
SELECT `Tags`.* FROM `Tags` INNER JOIN `EventTags` ON `Tags`.`tagsID` = `EventTags`.`tagsID` WHERE `EventTags`.`eventID` = 1

        <td>
          <% event.youtube.each do |link| %>
---
SELECT `Youtube`.* FROM `Youtube` WHERE `Youtube`.`eventID` = 1

        <td>
          <% event.spotify.each do |link| %>
---
SELECT `Spotify`.* FROM `Spotify` WHERE `Spotify`.`eventID` = 1

        <td>
          <% event.image.each do |link| %>
---
SELECT `Image`.* FROM `Image` WHERE `Image`.`eventID` = 1

        <td>
          <% event.eventdate.each do |link| %>
---
SELECT  `Event`.* FROM `Event` WHERE `Event`.`eventID` = 8 LIMIT 1
SELECT `EventDate`.* FROM `EventDate` WHERE `EventDate`.`eventID` = 1