UNIVENTO/app/views/event/show.html.erb

                        <% if @image.first.present?%>
                        <a href="<%= @image.first.image %>" data-gallery><%= image_tag @image.first.image %></a>
---
SELECT `Image`.* FROM `Image` WHERE `Image`.`eventID` = 1

                                    <li><i class="fa fa-tags"> <%= @event.category.name %></i></li>
                                    <% if @event.tags.length > 0 %>
---
SELECT `Tags`.* FROM `Tags` INNER JOIN `EventTags` ON `Tags`.`tagsID` = `EventTags`.`tagsID` WHERE `EventTags`.`eventID` = 1

                            <%if user_signed_in? %>
                               <% if @event.promoterID == current_user.userID && !@event.docsID.present? %>
---
SELECT  `Promoter`.* FROM `Promoter` WHERE `Promoter`.`promoterID` = 1 LIMIT 1

                   <!-- VIDEOS YOUTUBE-->
                   <% @event.youtube.each do |video| %>
---
SELECT `Youtube`.* FROM `Youtube` WHERE `Youtube`.`eventID` = 1

                <!-- SPOTIFY -->
                <% @event.spotify.each do |playlist| %>
---
SELECT `Spotify`.* FROM `Spotify` WHERE `Spotify`.`eventID` = 1