UNIVENTO/app/views/event/temp.html.erb

                         <a href="imgs/arraial.jpg" data-gallery>
                                <%= image_tag @image.first.image %>
---
SELECT  `Image`.* FROM `Image` WHERE `Image`.`eventID` = 1  ORDER BY `Image`.`imageID` ASC LIMIT 1

                    <!-- VIDEOS YOUTUBE-->
                    <% @event.youtube.each do |video| %>
---
SELECT `Youtube`.* FROM `Youtube` WHERE `Youtube`.`eventID` = 1

                    <!-- SPOTIFY -->
                    <% @event.spotify.each do |playlist| %>
---
SELECT `Spotify`.* FROM `Spotify` WHERE `Spotify`.`eventID` = 1