UNIVENTO/app/controllers/event_controller.rb

SELECT  `Event`.* FROM `Event` WHERE `Event`.`eventID` = 1 LIMIT 1
SELECT  `Image`.* FROM `Image` WHERE `Image`.`eventID` = 1  ORDER BY `Image`.`imageID` ASC LIMIT 1
---
	def show
    	begin
		  @event = Event.find(params[:id])
		  authorize! :read, @event, :message => "Evento indisponível"
		  @image = @event.image.all

SELECT `EventDate`.* FROM `EventDate` WHERE (`EventDate`.`startDate` BETWEEN '2015-11-24 15:50:56' AND '2019-11-24 15:50:56') GROUP BY `EventDate`.`eventID`  ORDER BY `EventDate`.`startDate` ASC
SELECT `EventDate`.* FROM `EventDate` WHERE `EventDate`.`eventID` = 1
SELECT  `Event`.* FROM `Event` WHERE `Event`.`eventID` = 20 LIMIT 1
---
	def index
		respond_to do |format|
	      format.html {
	      	redirect_to root_path and return
			@eventDates = Array.new
			eventDates2 = Array.new

			# ------------------- DB query -------------------------

			# Find events ordered by most closest date for the next 4 years from now.
			eventDates1 = EventDate.where(startDate: (Time.now)..Time.now + 1461.day).order(startDate: :asc)

			# ----- Active Events & remove duplicated --------------

			eventsID = Array.new

			eventDates1.each do |eventDate|
				if eventDate.event.activeDate < Time.now && !eventDate.event.propose && eventDate.event.propose != nil
					if !eventsID.include?(eventDate.eventID)

SELECT  `Local`.* FROM `Local` WHERE `Local`.`localID` = 1 LIMIT 1
---

			if local != nil
				@eventDates.each do |eventDate|
					if eventDate.local.address.upcase.include?(local.upcase)

SELECT  `Category`.* FROM `Category` WHERE `Category`.`categoryID` = 1 LIMIT 1
---
					nightCategoryID = Category.find_by(name: "Noturno").categoryID

					tagsPrefs = NormalTags.all
					categoriesPrefs = NormalCategory.all

SELECT `Tags`.* FROM `Tags` INNER JOIN `EventTags` ON `Tags`.`tagsID` = `EventTags`.`tagsID` WHERE `EventTags`.`eventID` = 1
---

					if tagsPrefs.length != 0
						@eventDates.each do |eventDate|
							eventDate.event.tags.each do |eventTag|

SELECT `Image`.* FROM `Image` WHERE `Image`.`eventID` = 1
---
					if eventDate.event.activeDate <= Time.now && !eventDate.event.propose && eventDate.event.propose != nil
						if !eventsID.include?(eventDate.eventID)
							img = nil
							if eventDate.event.image.present?